Revit 2027 API
ExternalDataManagerCommand Methods
The ExternalDataManagerCommand type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
RegisterCommand |  Registers a command.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace